[  
   {  
      "ID":"VKtlG5Ke320",
      "DurationInSeconds":8587,
      "Title":"Node JS top to Bottom",
      "ShortDescription":"Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient. Node.js' package ecosystem, npm, is the largest ecosystem of open source libraries in the world.",
      "Description":"<p>MongoDB and Node.js are often used together because of their shared use of JavaScript and its object notation (JSON). JSON is quickly becoming the standard data format for web APIs and, as such, these two technologies are growing in popularity. Mongoose is an object data modeling (ODM) library that provides a rigorous modeling environment for your data, enforcing structure as needed while still maintaining the flexibility that makes MongoDB powerful.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-Nodejsss.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-Nodejsss.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18FF0_8WHcpb3zY__eIW0G7"
   },
   {  
      "ID":"BtVCYTbFGQQ",
      "DurationInSeconds":8587,
      "Title":"Introduction of Gulp JS Build System ",
      "ShortDescription":"Automate and enhance your workflow",
      "Description":"<p>Easy to use<br/>By preferring code over configuration, gulp keeps things simple and makes complex tasks manageable.Efficient<br/>Using the power of node streams, gulp gives you fast builds that don't write intermediary files to disk.High Quality<br/>By enforcing strict plugin guidelines, we ensure that plugins stay simple and work as expected.Easy to Learn<br/>Using node best practices and maintaining a minimal API surface, your build works exactly as you would imagine.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-gulp.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-gulp.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL1856Pb0uEWTdKDk-aLqn-ok"
   },
   {  
      "ID":"1y_yLVLj69M",
      "DurationInSeconds":8587,
      "Title":"Introduction to Ajax ",
      "ShortDescription":"AJAX stands for Asynchronous JavaScript and XML. In a nutshell, it is the use of the XMLHttpRequest object to communicate with server-side scripts. It can send as well as receive information in a variety of formats, including JSON, XML, HTML, and even text files.",
      "Description":"<p>AJAX is a developer's dream, because you can:<br/>Update a web page without reloading the page <br/>Request data from a server - after the page has loaded  <br/>Receive data from a server - after the page has loaded <br/>Send data to a server - in the background <br/></p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ajax.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ajax.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL19HepuwTrf8Q1hEcbKOkO5j"
   },
   {  
      "ID":"oc_Aet6_80M",
      "DurationInSeconds":8587,
      "Title":"Angular 2.0 Training  Series ",
      "ShortDescription":"Develop Across All Platforms Learn one way to build applications with Angular and reuse your code and abilities to build apps for any deployment target. For web, mobile web, native mobile and native desktop.",
      "Description":"<p>Why Angular 2.0?</p><br/>       <p>Before getting into further discussion about Angular 2.0 (which has an estimated release date of the end of 2015), let’s briefly consider the philosophy behind the new version. Angular 2.0 development was started to address the following concerns:</p>       <p>Mobile<br/>       The new Angular version will be focused on the development of mobile apps. The rationale is that it’s easier to handle the desktop aspect of things, once the challenges related to mobile (performance, load time, etc.) have been addressed.       Modular<br/>       Various modules will be removed from Angular’s core, resulting in better performance. These will find their way into Angular’s ever-growing ecosystem of modules, meaning you’ll be able to pick and choose the parts you need.       Modern<br/>       Angular 2.0 will target ES6 and “evergreen” modern browsers (those automatically updated to the latest version). Building for these browsers means that various hacks and workarounds that make Angular harder to develop can be eliminated allowing developers to focus on the code related to their business domain.<p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-angular.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-angular.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18kc871H8_u4p1NYgpXXF0p"
   },
   {  
      "ID":"p_ks0FzrcnI",
      "DurationInSeconds":8587,
      "Title":"ES6 javascript coming version of Javascript es2015",
      "ShortDescription":"ES6 is a significant update to the language, and the first update to the language since ES5 was standardized in 2009. Implementation of these features in major JavaScript engines is underway now. See the ES6 standard for full specification of the ECMAScript 6 language",
      "Description":"JavaScript has come a long ways in its 20 years of existence. It’s grown from a language used to define a few variables and functions to one that can be used to build robust applications on the client-side and server-side. Although it’s popularity continues to grow in large part due to its dynamic nature and ability to run anywhere, JavaScript as a language is still missing many key features that could help increase developer productivity and provide a more maintainable code base. Fortunately, ECMAScript 6 (ES6) adds many new features that will take the language to the next level.           This is the first post in a series I’ll be writing that will walk through key features in ES6 and explain how they can be used. I’ll also introduce tools and other languages along the way that can be used to work with ES6 in different browsers as well as on the server-side with frameworks like Node.js. The goal of this first post is to discuss the viability of using ES6 today and point out resources that can help you get started using it. Let’s kick things off by talking about a few of the key features in ES6.           Key Features in ES6           So what are some of the key features in ES6? Here’s a list of some of my favorites:           Arrow functions – A short-hand version of an anonymous function.           Block-level scope – ES6 now supports scoping variables to blocks (if, for, while, etc.) using the let keyword.           Classes – ES6 classes provide a way to encapsulate and extend code.           Constants – You can now define constants in ES6 code using the const keyword.           Default parameters – Ever wished that a function parameter could be assigned a default value? You can do that now in ES6.           Destructuring – A succinct and flexible way to assign values from arrays or objects into variables.           Generators – Specialized functions that create iterators using function* and the yield keyword.           Map – Dictionary type object that can be used to store key/value pairs.           Modules – Provides a modular way of organizing and loading code.           Promises – Used with async operations.           Rest parameters – Replaces the need for using arguments to access functions arguments. Allows you to get to an array representing “the rest of the parameters”.           Set – A collection object that can be used to store a list of data values.           Template Strings – Clean way to build up string values.",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-es6+javascript"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-es6+javascript"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18sprMVE4h0AH-VnSGGOct7"
   },
   {  
      "ID":"7hcfHyG0Inw",
      "DurationInSeconds":8587,
      "Title":"React JS Training series : Everything about React with ES6",
      "ShortDescription":"React is a library developed by Facebook, and it is designed to build large applications with data that changes over time. Developers can use ReactJS to create user interfaces (UI) with high performance, where React would automatically manage all UI updates. React is all about building reusable web components, and it also renders on the server using Node.js. Learn ReactJS through online Learning Center, where you can find tutorials, videos, guides, and ReactJS tips & tricks from experienced ReactJS developers.",
      "Description":"<p>eact.js is a JavaScript Library developed by Facebook that functions as the V in an MVC. Known for its fast performance with a Virtual DOM, React.js is especially ideal for building mobile sites. What's more, since you can run React.js on the server, it's more SEO-friendly than other JavaScript Frameworks available. If you don't know JavaScript yet, you should probably start out with learning JavaScript.               To get a taste of how React works beyond a simple HelloWorld app, Facebook's official tutorial will teach you how to build your own realtime comment box with React. Once you have a feel for the library, you can go deeper and read the guides on how to build interactive and dynamic UI, form components, and more.                If you're building a website that deals with dynamic data, it is highly recommended you follow the Flux architectural design, which promotes a single directional dataflow. When React is used with Flux, it brings you the functionality of an MVC. However, according to Facebook, current MVCs don't scale well with building additional features to a large codebase, so React + Flux was their solution.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-react.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-react.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL1_2CpDKGg4-jNPqoirutxc5"
   },
   {  
      "ID":"Y0lP4L2oXKw",
      "DurationInSeconds":8587,
      "Title":"Node JS  with Mongoose",
      "ShortDescription":"Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient. Node.js' package ecosystem, npm, is the largest ecosystem of open source libraries in the world.",
      "Description":"<p>MongoDB and Node.js are often used together because of their shared use of JavaScript and its object notation (JSON). JSON is quickly becoming the standard data format for web APIs and, as such, these two technologies are growing in popularity. Mongoose is an object data modeling (ODM) library that provides a rigorous modeling environment for your data, enforcing structure as needed while still maintaining the flexibility that makes MongoDB powerful.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-mongo.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-mongo.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18HkRdiTrSgI8LQpamxNokl"
   },
   {  
      "ID":"OgFGKHjeQRc",
      "DurationInSeconds":8587,
      "Title":"understanding Javascript promises with RX JS",
      "ShortDescription":"Promises can replace the asynchronous use of callbacks, and they provide several benefits over them. They start to gain ground as more and more libraries and frameworks embrace them as their primary way to handle asynchronicity. Ember.js is a great example of such a framework.",
      "Description":"<p>Promises arrive in JavaScript! Promises have been around for a while in the form of libraries, such as:<br/>Q<br/>when<br/>WinJS<br/> RSVP.js<br/> The above and JavaScript promises share a common, standardised behaviour called Promises/A+. If you're a jQuery user, they have something similar called Deferreds. However, Deferreds aren't Promise/A+ compliant, which makes them subtly different and less useful, so beware. jQuery also has a Promise type, but this is just a subset of Deferred and has the same issues.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-promises.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-promises.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL1_AqgDvtNv2jiyG3PwZUBP2"
   },
   {  
      "ID":"E6D5_Ai0x6M",
      "DurationInSeconds":8587,
      "Title":"Angular 2.0 Beginner Course",
      "ShortDescription":"Angular 2 is the next version of Googles massively popular MV* framework for building complex applications in the browser (and beyond).Angular 2 comes with almost everything you need to build a complicated frontend web or mobile apps, from powerful templates to fast rendering, data management, HTTP services, form handling, and so much more.",
      "Description":"<p>A full framework with support for forms, http requests, and much more. It’s a complete toolkit to building a web app ES6 and TypeScript compatible meaning that it plays well with ES6 modules, class systems, and has type support. Smart Dependency Injection which can be used to pass in classes and services with specific configuration (across the app) or pass them to be named and used under a different name. Yet, you can still use your ES6 modules for anything that doesn’t fit the DI scheme. You also use have to inject directives for templating.                           Powerful templating that’s essentially HTML with sugar syntax that allows you to take advantage of two-way binding, events, etc. right in your templates. Built-in directives allow for even more powerful templating with foreach loops (for of), ngIf and others.                           Modular. Angular 2 is broken down to numerous sub-packages                           Angular Universal. A project that allows sharing Angular code between various platforms. There is work to make Angular work on the back-end and with NativeScript as part of app development. </p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/angular2-main.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/angular2-main.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL193Thvz6vcNa1gVQA4HMc1y"
   },
   {  
      "ID":"7uWv54Aq5Hw",
      "DurationInSeconds":8587,
      "Title":"Angular JS Best Practices ",
      "ShortDescription":"Learn how to easily build single-page web applications using this popular JavaScript framework.",
      "Description":"<p>Learn how to easily build single-page web applications using this popular JavaScript framework.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-angularbest.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-angularbest.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL186hYSyAdPdTzXR9fcW7zj9"
   },
   {  
      "ID":"fsMqPQeHj4M",
      "DurationInSeconds":8587,
      "Title":"Bootstrap responsiveness & angular js ",
      "ShortDescription":"UI Bootstrap Bootstrap components written in pure AngularJS by the AngularUI Team",
      "Description":"<p>Bootstrap and Angular are tools that a great number of people use. Often times, they are used together in projects. And why shouldn’t they be? They are both incredible tools that have changed the way CSS and JS work on the frontend.      There is a problem when using them together though, specifically when you try to bring in the Bootstrap JavaScript components into an Angular project. When building out Angular projects, you should not add on the full jQuery library. jQlite is already included in Angular and this should be all the jQuery that is necessary. This is an important concept to grasp since bringing jQuery into your Angular project will make it harder for you to fully grasp the power of Angular and its data-binding goodness</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-bootstrap.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-bootstrap.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18o8dJNgIPeZQuUJYInbJTq"
   },
   {  
      "ID":"DACmdCHYxA8",
      "DurationInSeconds":8587,
      "Title":"Mongo DB  Quick Introduction ",
      "ShortDescription":"MongoDB is an open-source document database, and leading NoSQL database. MongoDB is written in c++, This tutorial will give you great understanding on MongoDB concepts needed to create and deploy a highly scalable and performance oriented database.",
      "Description":"<p>This tutorial is designed for Software Professionals who are willing to learn MongoDB Database in simple and easy steps. This tutorial will give you great understanding on MongoDB concepts and after completing this tutorial you will be at intermediate level of expertise from where you can take yourself at higher level of expertise.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/mongodb-main.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/mongodb-main.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL1-tPts6VCiUriv54_Kbl2V3"
   },
   {  
      "ID":"dhCz3S9KId0",
      "DurationInSeconds":8587,
      "Title":"MEAN stack application development ",
      "ShortDescription":"The Friendly & Fun Javascript Fullstack  for your next web application MEAN is an opinionated fullstack javascript framework -  which simplifies and accelerates web application development.",
      "Description":"<p>MongoDB is the leading NoSQL database, empowering businesses to be more agile and scalable.<br/>   Express<br/>   Express is a minimal and flexible node.js web application framework, providing a robust set of features for building single and multi-page, and hybrid web applications.<br/>   AngularJS<br/>   AngularJS lets you extend HTML vocabulary for your application. The resulting environment is extraordinarily expressive, readable, and quick to develop.<br/>   Node.js<br/>   Node.js is a platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-meanmain.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-meanmain.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL19vi9ZX3IiXnDb9Yb95Pzh8"
   },
   {  
      "ID":"17gpncrCKV8",
      "DurationInSeconds":8587,
      "Title":"JQuery in web development ",
      "ShortDescription":"jQuery is a JavaScript Library. jQuery greatly simplifies JavaScript programming. jQuery is easy to learn.",
      "Description":"<p>jQuery is a lightweight JavaScript library. The purpose of jQuery is to make it much easier to use JavaScript on your website. jQuery takes a lot of common tasks that require many lines of JavaScript code to accomplish, and wraps them into methods that you can call with a single line of code. jQuery also simplifies a lot of the complicated things from JavaScript, like AJAX calls and DOM manipulation. The jQuery library contains the following features:<br/> HTML/DOM manipulation<br/> CSS manipulation<br/> HTML event methods<br/> Effects and animations<br/> AJAX<br/> Utilities<br/></p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-jquery.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-jquery.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18vzVelXE7qbNYuJCkdg9Wp"
   },
   {  
      "ID":"zvDub5xvP4w",
      "DurationInSeconds":8587,
      "Title":"Node JS for Beginners",
      "ShortDescription":"Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient. Node.js' package ecosystem, npm, is the largest ecosystem of open source libraries in the world.",
      "Description":"<p> Learn all about Node.js and start creating JavaScript applications in this course with Tarun Sharma. He shows how to install Node.js on Mac, Windows, and Linux and dives deep into its modules and Express framework for app development. Learn how to unit test your code, start sessions on web servers, stream data, and create simple command-line tools. Topics include:<br/> Why use Node.js?<br/> Installing Node.js<br/> Understanding the event loop<br/> Initializing Node.js projects<br/> Creating modules with getters and setters<br/> Starting Express applications<br/> Testing your code<br/> Working with sessions and databases<br/> Building command-line tools<br/> Emitting events and attaching listeners<br/> Controlling readable streams<br/></p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-nodebginner.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-nodebginner.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL19JkDXy0bUmdKkuFgk-yhCy"
   },
   {  
      "ID":"KNgWHVKJ6AE",
      "DurationInSeconds":8587,
      "Title":"Node  Json Web Token",
      "ShortDescription":"JSON Web Tokens are an open, industry standard RFC 7519 method for representing claims securely between two parties. JWT.IO allows you to decode, verify and generate JWT. LEARN MORE ABOUT JWT",
      "Description":"<p>JSON Web Token (JWT) is an open standard (RFC 7519) that defines a compact and self-contained way for securely transmitting information between parties as a JSON object. This information can be verified and trusted because it is digitally signed. JWTs can be signed using a secret (with the HMAC algorithm) or a public/private key pair using RSA.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-jwt.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-jwt.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL19GI17sMIEtlaNCVhUhRFPH"
   },
   {  
      "ID":"OMrAxI5cXm4",
      "DurationInSeconds":8587,
      "Title":"Introduction to Ionic framework ",
      "ShortDescription":"Build and scale amazing mobile apps, the easy way. Cross-platform mobile services that help you nail the basics and focus on delivering top-notch apps.",
      "Description":"<p>Powerful tools, all in one place<br/> The one central hub to engage with and manage your users, deploy live updates, and track your native builds. Developer focused<br/> Developers are at the heart of every great app. Our platform makes designing and developing apps a joy. Built with teams in mind<br/> Invite team members to collaborate on your Ionic apps with unique developer accounts and more. Designed to work seamlessly with Ionic Framework<br/> The Ionic Platform has been built to work beautifully with apps built using the open source Ionic Framework.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ionic.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ionic.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL19wVC5EKghMwbSlfF8jZJcB"
   },
   {  
      "ID":"jUvGpV5v-A4",
      "DurationInSeconds":8587,
      "Title":"Node JS top to Bottom",
      "ShortDescription":"Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient. Node.js' package ecosystem, npm, is the largest ecosystem of open source libraries in the world.",
      "Description":"<p>MongoDB and Node.js are often used together because of their shared use of JavaScript and its object notation (JSON). JSON is quickly becoming the standard data format for web APIs and, as such, these two technologies are growing in popularity. Mongoose is an object data modeling (ODM) library that provides a rigorous modeling environment for your data, enforcing structure as needed while still maintaining the flexibility that makes MongoDB powerful.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-nodejs.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-nodejs.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL1_ZiPcc0MmuDBxczqofgipj"
   },
   {  
      "ID":"eSp1xBHCSyI",
      "DurationInSeconds":8587,
      "Title":"Understanding JavaScript ES5",
      "ShortDescription":"This chapter lists features that are available only in ECMAScript 5. Should you have to work with older JavaScript engines, you should avoid these features or enable some of them via a library (how is described later). Note that normally, this book assumes that you are working with modern engines, which fully support ECMAScript 5.",
      "Description":"<p>This chapter lists features that are available only in ECMAScript 5. Should you have to work with older JavaScript engines, you should avoid these features or enable some of them via a library (how is described later). Note that normally, this book assumes that you are working with modern engines, which fully support ECMAScript 5.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ESS55.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ESS55.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL1-95iqCJEBsePzpMed9D3f3"
   },
   {  
      "ID":"de6KwxKyHWY",
      "DurationInSeconds":8587,
      "Title":"Node JS ice Breaker",
      "ShortDescription":"Node.js® is a JavaScript runtime built on Chrome's V8 JavaScript engine. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient. Node.js' package ecosystem, npm, is the largest ecosystem of open source libraries in the world.",
      "Description":"<p>MongoDB and Node.js are often used together because of their shared use of JavaScript and its object notation (JSON). JSON is quickly becoming the standard data format for web APIs and, as such, these two technologies are growing in popularity. Mongoose is an object data modeling (ODM) library that provides a rigorous modeling environment for your data, enforcing structure as needed while still maintaining the flexibility that makes MongoDB powerful.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-nodeicebreaker.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-nodeicebreaker.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18-QnXuAaXnOm4XazcrV0m-"
   },
   {  
      "ID":"6qDx4NPtHrs",
      "DurationInSeconds":8587,
      "Title":"Angular 2 0 introdution ",
      "ShortDescription":"Recently Angularjs team has launched a 5 mins quick start tutorial on getting started with Angular 2.0. I have taken the same tutorial (with minor changes) and explained it below. There are a lot of blanks to be filled, but this is my first attempt at Angular 2.0.",
      "Description":"<p>Recently Angularjs team has launched a 5 mins quick start tutorial on getting started with Angular 2.0. I have taken the same tutorial (with minor changes) and explained it below. There are a lot of blanks to be filled, but this is my first attempt at Angular 2.0.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-angularjscomingversion.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-angularjscomingversion.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL19DFL6NZhCDLsSXFTU3KIFd"
   },
   {  
      "ID":"9XJ7NwNlrEc",
      "DurationInSeconds":8587,
      "Title":"Grunt web Build System ",
      "ShortDescription":"During our web development workflows, there are many tasks that we have to repeat. These are tasks things like minifying JavaScript and CSS files, unit testing, linting your files to check for errors, compiling CSS preprocessor files (LESS, SASS), and much more. Grunt is a task runner. This means that those repetitive tasks we deal with in our daily workflow gets automated. This will be a simple look at how to get up and running with Grunt. We will look at doing the basic tasks:",
      "Description":"<p>During our web development workflows, there are many tasks that we have to repeat. These are tasks things like minifying JavaScript and CSS files, unit testing, linting your files to check for errors, compiling CSS preprocessor files (LESS, SASS), and much more. Grunt is a task runner. This means that those repetitive tasks we deal with in our daily workflow gets automated. This will be a simple look at how to get up and running with Grunt. We will look at doing the basic tasks:</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-Grunt.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-Grunt.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18nB4NpFw20I5g6K34hEgZW"
   },
   {  
      "ID":"7c4IzB8HNBA",
      "DurationInSeconds":8587,
      "Title":"Introduction to ECMAScript 6 ",
      "ShortDescription":"Introduction. ECMAScript 6, also known as ECMAScript 2015, is the latest version of the ECMAScript standard. ES6 is a significant update to the language, and the first update to the language since ES5 was standardized in 2009. Implementation of these features in major JavaScript engines is underway now.",
      "Description":"<p>Introduction. ECMAScript 6, also known as ECMAScript 2015, is the latest version of the ECMAScript standard. ES6 is a significant update to the language, and the first update to the language since ES5 was standardized in 2009. Implementation of these features in major JavaScript engines is underway now.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ES6.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ES6.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18oDFsYEUrie5pNZO4ZQmed"
   },
   {  
      "ID":"W2jz_Bu0CR0",
      "DurationInSeconds":8587,
      "Title":"DevOps for developers ",
      "ShortDescription":"DevOps (a clipped compound of development and operations) is a culture, movement or practice that emphasizes the collaboration and communication of both software developers and other information-technology (IT) professionals while automating the process of software delivery and infrastructure changes.",
      "Description":"<p>In this course, we look at the necessity of Devops and how a DevOps transformation can help focus on value and streamlined delivery. We will also cover concepts like Automation and technology which play huge roles in DevOps success; in this course we'll analyze the major capability areas and which technologies can get your team on its way.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-devopss.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-devopss.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL1-cNk-f2fFysgesRQ8l9dSw"
   },
   {  
      "ID":"MuPW017Tmwc",
      "DurationInSeconds":8587,
      "Title":"Developing application using Angular 1.x ",
      "ShortDescription":"AngularJS tutorial course covers the fundamental concepts of Angular like directives, routes, filters, services and factors that help you build rich user interface web apps. The course also encompasses many efficient Angular features like data binding, scope management, form validation, routing, i18n and a lot more. You will also get hands-on experience in implementing an AngularJS mean stack-based project  giving you a 360 degrees insight on the framework along with NodeJS.",
      "Description":"<p>Boost your web application development skills and become an invaluable SPA (single page application) developer. Discover more about 2-way data binding, Google Chrome extensions, DOM manipulations and more to create and build your own applications using the popular Javascript MVC (model-view-controller) architecture and REST APIs.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-angular1.xx.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-angular1.xx.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeVideoId":"PLIGDNOJWiL18IgDrDzKw4xJYYtHg2FOuO"
   },
   {  
      "ID":"zZugnTPi9yI",
      "DurationInSeconds":8587,
      "Title":"Dev Ops Platform Containers",
      "ShortDescription":"Learn how to get started with Docker and Amazon Web Services with tutorials.",
      "Description":"<p>Docker is a technology that allows you to build, run, test, and deploy distributed applications that are based on Linux containers. Amazon ECS uses Docker images in task definitions to launch containers on EC2 instances in your clusters. For Amazon ECS product details, featured customer case studies</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ec2ops.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-ec2ops.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeV_ideo_id":"PLIGDNOJWiL19fuoAWicNQBD2DWionSkss"
   },
   {  
      "ID":"uWIQ_6WgUNM",
      "DurationInSeconds":8587,
      "Title":"React JS Training series with ES5",
      "ShortDescription":"React is a library developed by Facebook, and it is designed to build large applications with data that changes over time. Developers can use ReactJS to create user interfaces (UI) with high performance, where React would automatically manage all UI updates. React is all about building reusable web components, and it also renders on the server using Node.js. Learn ReactJS through online Learning Center, where you can find tutorials, v_ideos, gu_ides, and ReactJS tips & tricks from experienced ReactJS developers.",
      "Description":"<p>React.js is a JavaScript Library developed by Facebook that functions as the V in an MVC. Known for its fast performance with a Virtual DOM, React.js is especially _ideal for building mobile sites. What's more, since you can run React.js on the server, it's more SEO-friendly than other JavaScript Frameworks available. If you don't know JavaScript yet, you should probably start out with learning JavaScript.               To get a taste of how React works beyond a simple HelloWorld app, Facebook's official tutorial will teach you how to build your own realtime comment box with React. Once you have a feel for the library, you can go deeper and read the gu_ides on how to build interactive and dynamic UI, form components, and more.                If you're building a website that deals with dynamic data, it is highly recommended you follow the Flux architectural design, which promotes a single directional dataflow. When React is used with Flux, it brings you the functionality of an MVC. However, according to Facebook, current MVCs don't scale well with building additional features to a large codebase, so React + Flux was their solution.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/Main-ReactJSES5js.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/Main-ReactJSES5js.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeV_ideo_id":"PLIGDNOJWiL1_ndMWBpMvo8oAXuR7bjnWM"
   },
   {  
      "ID":"d2zAHQRPYW8",
      "DurationInSeconds":8587,
      "Title":"Spring framework Training",
      "ShortDescription":"Spring framework is an open source Java platform that provides comprehensive infrastructure support for developing robust Java applications very easily and very rapidly.",
      "Description":"<p>The Spring Framework is an application framework and inversion of control container for the Java platform. The framework's core features can be used by any Java application, but there are extensions for building web applications on top of the Java EE platform. Although the framework does not impose any specific programming model, it has become popular in the Java community as an alternative to, replacement for, or even addition to the Enterprise JavaBeans EJB  model. The Spring Framework is open source.</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-SpringJava.jpg"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-SpringJava.jpg"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeV_ideo_id":"PLIGDNOJWiL1-CpMam0hTsSSXElmOo23D4"
   },
   {  
      "ID":"9NEYA15n2n8",
      "DurationInSeconds":8587,
      "Title":"Elastic Search Introduction and feature",
      "ShortDescription":"Elasticsearch is a search server based on Lucene. It provides a distributed, multitenant-capable full-text search engine with an HTTP web interface and schema-free JSON documents. Elasticsearch is developed in Java and is released as open source under the terms of the Apache License. Elasticsearch is the most popular enterprise search engine followed by Apache Solr",
      "Description":"<p>Elasticsearch is a search server based on Lucene. It provides a distributed, multitenant-capable full-text search engine with an HTTP web interface and schema-free JSON documents. Elasticsearch is developed in Java and is released as open source under the terms of the Apache License. Elasticsearch is the most popular enterprise search engine followed by Apache Solr</p>",
      "Thumbnails":[  
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-elastic.png"
         },
         {  
            "FullURL":"https://s3-eu-west-1.amazonaws.com/ubmas-bucket/tmp/main-elastic.png"
         }
      ],
      "URLs":{  
         "www.youtube.com":"/CSS-tutorials/Building-Responsive-Single-Page-Design-PostCSS/417644-2.html"
      },
      "WelcomeV_ideo_id":"PLIGDNOJWiL18dVcKSrsqA8HzmwiBxrHYu"
   }
]